zekeng/msp432r-core/variants/MSP_EXP432P401R_BHS_Rev1/Board_init.c
/*
 * Copyright (c) 2015-2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ======== Board_init.c ========
 *  This file is responsible for setting up the board specific items for the
 *  MSP_EXP432P401R Launch Pad board.
 */

#include <stdbool.h>

#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerMSP432.h>

#include <ti/devices/msp432p4xx/inc/msp.h>
#include <ti/devices/msp432p4xx/driverlib/rom.h>
#include <ti/devices/msp432p4xx/driverlib/rom_map.h>
#include <ti/devices/msp432p4xx/driverlib/adc14.h>
#include <ti/devices/msp432p4xx/driverlib/dma.h>
#include <ti/devices/msp432p4xx/driverlib/gpio.h>
#include <ti/devices/msp432p4xx/driverlib/i2c.h>
#include <ti/devices/msp432p4xx/driverlib/interrupt.h>
#include <ti/devices/msp432p4xx/driverlib/pmap.h>
#include <ti/devices/msp432p4xx/driverlib/ref_a.h>
#include <ti/devices/msp432p4xx/driverlib/spi.h>
#include <ti/devices/msp432p4xx/driverlib/timer_a.h>
#include <ti/devices/msp432p4xx/driverlib/timer32.h>
#include <ti/devices/msp432p4xx/driverlib/uart.h>
#include <ti/devices/msp432p4xx/driverlib/wdt_a.h>

#include "Board.h"

/*
 *  =============================== ADC ===============================
 */
#include <ti/drivers/ADC.h>
#include <ti/drivers/adc/ADCMSP432.h>

void ADCMSP432_close(ADC_Handle handle);
int_fast16_t ADCMSP432_control(ADC_Handle handle, uint_fast16_t cmd, void *arg);
int_fast16_t ADCMSP432_convert(ADC_Handle handle, uint16_t *value);
uint32_t ADCMSP432_convertRawToMicroVolts(ADC_Handle handle,
    uint16_t rawAdcValue);
void ADCMSP432_init(ADC_Handle handle);
ADC_Handle ADCMSP432_open(ADC_Handle handle, ADC_Params *params);

/* ADC function table for ADCMSP432 implementation */
const ADC_FxnTable myADCMSP432_fxnTable = {
    ADCMSP432_close,
    NULL, /* ADCMSP432_control, */
    ADCMSP432_convert,
    NULL, /* ADCMSP432_convertRawToMicroVolts, */
    ADCMSP432_init,
    ADCMSP432_open
};

/* ADC objects */
ADCMSP432_Object adcMSP432Objects[Board_ADCCOUNT];

/* ADC configuration structure */
ADCMSP432_HWAttrsV1 adcMSP432HWAttrs[Board_ADCCOUNT] = {
    {
        .adcPin = ADCMSP432_P5_5_A0,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P5_4_A1,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P5_3_A2,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P5_2_A3,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P5_1_A4,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P5_0_A5,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P4_7_A6,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P4_6_A7,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P4_5_A8,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P4_4_A9,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P4_3_A10,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P4_2_A11,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P4_1_A12,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P4_0_A13,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P6_1_A14,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P6_0_A15,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P9_1_A16,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P9_0_A17,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P8_7_A18,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P8_6_A19,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P8_5_A20,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P8_4_A21,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P8_3_A22,
        .refVoltage = ADCMSP432_REF_VOLTAGE_VDD,
        .resolution = ADC_14BIT
    },
    {
        .adcPin = ADCMSP432_P8_2_A23,
        .refVoltage = REF_A_VREF1_45V,
        .resolution = ADC_8BIT
    }
};

const ADC_Config ADC_config[Board_ADCCOUNT] = {
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[0],
        .hwAttrs = &adcMSP432HWAttrs[0]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[1],
        .hwAttrs = &adcMSP432HWAttrs[1]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[2],
        .hwAttrs = &adcMSP432HWAttrs[2]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[3],
        .hwAttrs = &adcMSP432HWAttrs[3]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[4],
        .hwAttrs = &adcMSP432HWAttrs[4]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[5],
        .hwAttrs = &adcMSP432HWAttrs[5]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[6],
        .hwAttrs = &adcMSP432HWAttrs[6]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[7],
        .hwAttrs = &adcMSP432HWAttrs[7]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[8],
        .hwAttrs = &adcMSP432HWAttrs[8]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[9],
        .hwAttrs = &adcMSP432HWAttrs[9]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[10],
        .hwAttrs = &adcMSP432HWAttrs[10]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[11],
        .hwAttrs = &adcMSP432HWAttrs[11]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[12],
        .hwAttrs = &adcMSP432HWAttrs[12]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[13],
        .hwAttrs = &adcMSP432HWAttrs[13]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[14],
        .hwAttrs = &adcMSP432HWAttrs[14]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[15],
        .hwAttrs = &adcMSP432HWAttrs[15]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[16],
        .hwAttrs = &adcMSP432HWAttrs[16]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[17],
        .hwAttrs = &adcMSP432HWAttrs[17]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[18],
        .hwAttrs = &adcMSP432HWAttrs[18]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[19],
        .hwAttrs = &adcMSP432HWAttrs[19]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[20],
        .hwAttrs = &adcMSP432HWAttrs[20]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[21],
        .hwAttrs = &adcMSP432HWAttrs[21]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[22],
        .hwAttrs = &adcMSP432HWAttrs[22]
    },
    {
        .fxnTablePtr = &myADCMSP432_fxnTable,
        .object = &adcMSP432Objects[23],
        .hwAttrs = &adcMSP432HWAttrs[23]
    }
};

const uint_least8_t ADC_count = Board_ADCCOUNT;

