zekeng/msp432r-core/variants/MSP_EXP432P401R_BHS_Rev1/Board_init.c
/*
 *  =============================== DMA ===============================
 */

#include <ti/drivers/dma/UDMAMSP432.h>


#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_ALIGN(dmaControlTable, 256)
#elif defined(__IAR_SYSTEMS_ICC__)
#pragma data_alignment=256
#elif defined(__GNUC__)
__attribute__ ((aligned (256)))
#endif
static DMA_ControlTable dmaControlTable[8];

/*
 *  ======== dmaErrorHwi ========
 *  This is the handler for the uDMA error interrupt.
 */
static void dmaErrorHwi(uintptr_t arg)
{
    int status = MAP_DMA_getErrorStatus();
    MAP_DMA_clearErrorStatus();

    /* Suppress unused variable warning */
    (void)status;

    while (1);
}

UDMAMSP432_Object udmaMSP432Object;

const UDMAMSP432_HWAttrs udmaMSP432HWAttrs = {
    .controlBaseAddr = (void *)dmaControlTable,
    .dmaErrorFxn = (UDMAMSP432_ErrorFxn)dmaErrorHwi,
    .intNum = INT_DMA_ERR,
    .intPriority = (~0)
};

const UDMAMSP432_Config UDMAMSP432_config = {
    .object = &udmaMSP432Object,
    .hwAttrs = &udmaMSP432HWAttrs
};

/*
 *  =============================== General ===============================
 */

/*
 *  ======== Board_initGeneral ========
 */
void Board_initGeneral(void)
{
    Power_init();
}

/*
 *  =============================== GPIO ===============================
 */

#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOMSP432.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in MSP_EXP432P401R.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array.  Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* port_pin */
    GPIOMSP432_EMPTY_PIN | GPIO_DO_NOT_CONFIG,  /*  0  - dummy */

    GPIOMSP432_P1_0 | GPIO_DO_NOT_CONFIG,    /*  1 - BUTTON1 - User Button 1 */
    GPIOMSP432_P1_1 | GPIO_DO_NOT_CONFIG,    /*  2 - BUTTON2 - User Button 2 */
    GPIOMSP432_P1_2 | GPIO_DO_NOT_CONFIG,    /*  3 - BCLUART_RXD - Debug Serial RX */
    GPIOMSP432_P1_3 | GPIO_DO_NOT_CONFIG,    /*  4 - BCLUART_TXD - Debug Serial TX */
    GPIOMSP432_P1_4 | GPIO_DO_NOT_CONFIG,    /*  5 - FL_SPI_CS# - FLASH Chip Select (active low) */
    GPIOMSP432_P1_5 | GPIO_DO_NOT_CONFIG,    /*  6 - FL_SPI_CLK - FLASH SPI CLOCK */
    GPIOMSP432_P1_6 | GPIO_DO_NOT_CONFIG,    /*  7 - FL_SPI_MOSI - FLASH Master Output Slave Input */
    GPIOMSP432_P1_7 | GPIO_DO_NOT_CONFIG,    /*  8 - FL_SPI_MISO - FLASH Master Input Slave Output */

    GPIOMSP432_P2_0 | GPIO_DO_NOT_CONFIG,    /*  9 - SIM800_UART_CTS - SIM800 UART CTS */
    GPIOMSP432_P2_1 | GPIO_DO_NOT_CONFIG,    /* 10 - SIM800_UART_RTS - SIM800 UART RTS */
    GPIOMSP432_P2_2 | GPIO_DO_NOT_CONFIG,    /* 11 - SIM800_UART_RX - SIM800 UART RX */
    GPIOMSP432_P2_3 | GPIO_DO_NOT_CONFIG,    /* 12 - SIM800_UART_TX - SIM800 UART TX */

    GPIOMSP432_P3_0 | GPIO_DO_NOT_CONFIG,    /* 13 - A1_PD_SCK - SENSOR A1 CLOCK */
    GPIOMSP432_P3_1 | GPIO_DO_NOT_CONFIG,    /* 14 - B1_PD_SCK - SENSOR B1 CLOCK */
    GPIOMSP432_P3_2 | GPIO_DO_NOT_CONFIG,    /* 15 - BT_RXD - Bluetooth UART RX */
    GPIOMSP432_P3_3 | GPIO_DO_NOT_CONFIG,    /* 16 - BT_TXD - Bluetooth UART TX */
    GPIOMSP432_P3_4 | GPIO_DO_NOT_CONFIG,    /* 17 - GSM_PWR_EN - GSM Power Enable */
    GPIOMSP432_P3_5 | GPIO_DO_NOT_CONFIG,    /* 18 - SIM800_PWR_ON - SIM800 Power On */
    GPIOMSP432_P3_6 | GPIO_DO_NOT_CONFIG,    /* 19 - BT_GPIO1 - Bluetooth GPIO1 */
    GPIOMSP432_P3_7 | GPIO_DO_NOT_CONFIG,    /* 20 - BT_GPIO2 - Bluetooth GPIO2 */

    GPIOMSP432_P4_2 | GPIO_DO_NOT_CONFIG,    /* 21 - SIM800_RING - SIM800 RING */
    GPIOMSP432_P4_3 | GPIO_DO_NOT_CONFIG,    /* 22 - SIM800_NET_STAT - SIM800 NET STATUS */
    GPIOMSP432_P4_4 | GPIO_DO_NOT_CONFIG,    /* 23 - SIM800_STAT - SIM800 STATUS */
    GPIOMSP432_P4_5 | GPIO_DO_NOT_CONFIG,    /* 24 - SIM800_DCD - SIM800 DCD */
    GPIOMSP432_P4_6 | GPIO_DO_NOT_CONFIG,    /* 25 - SIM800_PWR_MON - SIM800 Power Monitor */
    GPIOMSP432_P4_7 | GPIO_DO_NOT_CONFIG,    /* 26 - A2_PD_SCK - Sensor A2 CLOCK */

    GPIOMSP432_P5_0 | GPIO_DO_NOT_CONFIG,    /* 27 - A1_DOUT - Sensor A1 Digital OUTPUT */
    GPIOMSP432_P5_1 | GPIO_DO_NOT_CONFIG,    /* 28 - B1_DOUT - Sensor B1 Digital OUTPUT */
    GPIOMSP432_P5_2 | GPIO_DO_NOT_CONFIG,    /* 29 - A2_DOUT - Sensor A2 Digital OUTPUT */
    GPIOMSP432_P5_3 | GPIO_DO_NOT_CONFIG,    /* 30 - B2_DOUT - Sensor B2 Digital OUTPUT */
    GPIOMSP432_P5_4 | GPIO_DO_NOT_CONFIG,    /* 31 - TMP_ALERT - TMP1075 Alert Pin */
    GPIOMSP432_P5_5 | GPIO_DO_NOT_CONFIG,    /* 32 - Vbat_MSRMNT - Vbatt Measurement Signal */
    GPIOMSP432_P5_6 | GPIO_DO_NOT_CONFIG,    /* 33 - EN3V3 - 3.3V Enable Pin */
    GPIOMSP432_P5_7 | GPIO_DO_NOT_CONFIG,    /* 34 - EN_Vbat_SW - Vbatt Enable */

    GPIOMSP432_P6_6 | GPIO_DO_NOT_CONFIG,    /* 35 - I2C_SDA - TMP1075 SDA */
    GPIOMSP432_P6_7 | GPIO_DO_NOT_CONFIG,    /* 36 - I2C_SCL - TMP1075 SCL */

    GPIOMSP432_P7_0 | GPIO_DO_NOT_CONFIG,    /* 37 - DQ1 DS18B20 - Data Pin (not used) */
    GPIOMSP432_P7_1 | GPIO_DO_NOT_CONFIG,    /* 38 - DQ2 DS18B20 - Data Pin (not used) */
    GPIOMSP432_P7_2 | GPIO_DO_NOT_CONFIG,    /* 39 - LED_RED - Red LED */
    GPIOMSP432_P7_3 | GPIO_DO_NOT_CONFIG,    /* 40 - LED_GREEN - Green LED */

    GPIOMSP432_P8_0 | GPIO_DO_NOT_CONFIG,    /* 41 - CLEAR_WDT - External WDT Clear Pin */
    GPIOMSP432_P8_1 | GPIO_DO_NOT_CONFIG     /* 42 - B2_PD_SCK - SENSOR B2 CLOCK */
};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in MSP_EXP432P401R.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    /* port_pin */
    NULL,  /*  0  - dummy */

    NULL,    /*  1 - BUTTON1 - User Button 1 */
    NULL,    /*  2 - BUTTON2 - User Button 2 */
    NULL,    /*  3 - BCLUART_RXD - Debug Serial RX */
    NULL,    /*  4 - BCLUART_TXD - Debug Serial TX */
    NULL,    /*  5 - FL_SPI_CS# - FLASH Chip Select (active low) */
    NULL,    /*  6 - FL_SPI_CLK - FLASH SPI CLOCK */
    NULL,    /*  7 - FL_SPI_MOSI - FLASH Master Output Slave Input */
    NULL,    /*  8 - FL_SPI_MISO - FLASH Master Input Slave Output */
    NULL,    /*  9 - SIM800_UART_CTS - SIM800 UART CTS */
    NULL,    /* 10 - SIM800_UART_RTS - SIM800 UART RTS */
    NULL,    /* 11 - SIM800_UART_RX - SIM800 UART RX */
    NULL,    /* 12 - SIM800_UART_TX - SIM800 UART TX */
    NULL,    /* 13 - A1_PD_SCK - SENSOR A1 CLOCK */
    NULL,    /* 14 - B1_PD_SCK - SENSOR B1 CLOCK */
    NULL,    /* 15 - BT_RXD - Bluetooth UART RX */
    NULL,    /* 16 - BT_TXD - Bluetooth UART TX */
    NULL,    /* 17 - GSM_PWR_EN - GSM Power Enable */
    NULL,    /* 18 - SIM800_PWR_ON - SIM800 Power On */
    NULL,    /* 19 - BT_GPIO1 - Bluetooth GPIO1 */
    NULL,    /* 20 - BT_GPIO2 - Bluetooth GPIO2 */
    NULL,    /* 21 - SIM800_RING - SIM800 RING */
    NULL,    /* 22 - SIM800_NET_STAT - SIM800 NET STATUS */
    NULL,    /* 23 - SIM800_STAT - SIM800 STATUS */
    NULL,    /* 24 - SIM800_DCD - SIM800 DCD */
    NULL,    /* 25 - SIM800_PWR_MON - SIM800 Power Monitor */
    NULL,    /* 26 - A2_PD_SCK - Sensor A2 CLOCK */
    NULL,    /* 27 - A1_DOUT - Sensor A1 Digital OUTPUT */
    NULL,    /* 28 - B1_DOUT - Sensor B1 Digital OUTPUT */
    NULL,    /* 29 - A2_DOUT - Sensor A2 Digital OUTPUT */
    NULL,    /* 30 - B2_DOUT - Sensor B2 Digital OUTPUT */
    NULL,    /* 31 - TMP_ALERT - TMP1075 Alert Pin */
    NULL,    /* 32 - Vbat_MSRMNT - Vbatt Measurement Signal */
    NULL,    /* 33 - EN3V3 - 3.3V Enable Pin */
    NULL,    /* 34 - EN_Vbat_SW - Vbatt Enable */
    NULL,    /* 35 - I2C_SDA - TMP1075 SDA */
    NULL,    /* 36 - I2C_SCL - TMP1075 SCL */
    NULL,    /* 37 - DQ1 DS18B20 - Data Pin (not used) */
    NULL,    /* 38 - DQ2 DS18B20 - Data Pin (not used) */
    NULL,    /* 39 - LED_RED - Red LED */
    NULL,    /* 40 - LED_GREEN - Green LED */
    NULL,    /* 41 - CLEAR_WDT - External WDT Clear Pin */
    NULL     /* 42 - B2_PD_SCK - SENSOR B2 CLOCK */
};

