zekeng/msp432r-core/variants/MSP_EXP432P401R_BHS_Rev1/Board_init.c
/* The device-specific GPIO_config structure */
const GPIOMSP432_Config GPIOMSP432_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = (~0)
};

/* Not sure why the SVSLOFF bit is undefined in the latest driverlib msp432p401r.h file */

#define SVSLOFF 0x00000100

/*
 *  ======== Board_initGPIO ========
 */
void Board_initGPIO(void)
{
    /* Terminate all IO pins on the device */
    P1DIR |= 0xFF; P1OUT = 0;
    P2DIR |= 0xFF; P2OUT = 0;
    P3DIR |= 0xFF; P3OUT = 0;
    P4DIR |= 0xFF; P4OUT = 0;
    P5DIR |= 0xFF; P5OUT = 0;
    P6DIR |= 0xFF; P6OUT = 0;
    P7DIR |= 0xFF; P7OUT = 0;
    P8DIR |= 0xFF; P8OUT = 0;
    P9DIR |= 0xFF; P9OUT = 0;
    P10DIR |= 0xFF; P10OUT = 0;

    /* Configure Port PJ.2 and PJ.3 as GPIO and write 0 */
    PJDIR |= (BIT2 | BIT3); PJOUT &= ~(BIT2 | BIT3);

    /* PJ.0 & PJ.1 configured for LFXT IN/OUT */
    PJSEL0 |= BIT0 | BIT1;
    PJSEL1 &= ~(BIT0 | BIT1);

    /* Turn off PSS high-side & low-side supervisors */
    PSS->KEY = PSS_KEY_KEY_VAL;
    PSS->CTL0 |= PSS_CTL0_SVSMHOFF | SVSLOFF;         /* 823 (14) uA -> 809 (3) uA */
    PSS->KEY = 0;

    /* Configure Port PJ.4 and PJ.5 */
    ; /* do nothing (the reset default is to support JTAG) */

    /* set up initial TI-RTOS GPIO pin configurations */
    GPIO_init();
}

/*
 *  =============================== I2C ===============================
 */

#include <ti/drivers/I2C.h>
#include <ti/drivers/i2c/I2CMSP432.h>

extern void I2CMSP432_cancel(I2C_Handle handle);
extern void I2CMSP432_close(I2C_Handle handle);
extern int_fast16_t I2CMSP432_control(I2C_Handle handle, uint_fast16_t cmd, void *arg);
extern void I2CMSP432_init(I2C_Handle handle);
extern I2C_Handle I2CMSP432_open(I2C_Handle handle, I2C_Params *params);
extern bool I2CMSP432_transfer(I2C_Handle handle, I2C_Transaction *transaction);

const I2C_FxnTable myI2CMSP432_fxnTable = {
    NULL, /* I2CMSP432_cancel, */
    I2CMSP432_close,
    NULL, /* I2CMSP432_control, */
    I2CMSP432_init,
    I2CMSP432_open,
    I2CMSP432_transfer
};

/* I2C objects */
I2CMSP432_Object i2cMSP432Objects[Board_I2CCOUNT];

/* I2C configuration structure */
const I2CMSP432_HWAttrsV1 i2cMSP432HWAttrs[Board_I2CCOUNT] = {
    {
        .baseAddr = EUSCI_B3_BASE,
        .intNum = INT_EUSCIB3,
        .intPriority = (~0),
        .clockSource = EUSCI_B_I2C_CLOCKSOURCE_SMCLK,
        .dataPin = I2CMSP432_P6_6_UCB3SDA,
        .clkPin = I2CMSP432_P6_7_UCB3SCL
    }
};

const I2C_Config I2C_config[] = {
    {
        .fxnTablePtr = &myI2CMSP432_fxnTable,
        .object = &i2cMSP432Objects[0],
        .hwAttrs = &i2cMSP432HWAttrs[0]
    }
};

const uint_least8_t I2C_count = Board_I2CCOUNT;

/*
 *  =============================== NVS ===============================
 *  Non-Volatile Storage configuration.
 */
#include <ti/drivers/NVS.h>
#include <ti/drivers/nvs/NVSMSP432.h>

NVSMSP432_Object nvsMSP432Objects[1];

extern uint8_t __NVS_BASE__;
extern uint8_t __NVS_SIZE__;

NVSMSP432_HWAttrs nvsMSP432HWAttrs[1] = {
    {
        .regionBase = (void *)&__NVS_BASE__,   /* base of unused flash aligned on 4k boundary */
        .regionSize = (size_t)(&__NVS_SIZE__) 
    },
};

const NVS_Config NVS_config[] = {
    {
        &NVSMSP432_fxnTable,
        &nvsMSP432Objects[0],
        &nvsMSP432HWAttrs[0]
    },
};

int NVS_count = 1;

/*
 *  =============================== Power ===============================
 */

#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerMSP432.h>

const PowerMSP432_ConfigV1 PowerMSP432_config = {
    .policyInitFxn = PowerMSP432_initPolicy,
    .policyFxn = PowerMSP432_deepSleepPolicy,
    .initialPerfLevel = 2,
    .enablePolicy = true,
    .enablePerf = true,
    .enableParking = true
};

/*
 *  ======== Board_initPower ========
 */
void Board_initPower(void)
{
    Power_init();
}

/*
 *  =============================== PWM ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */

#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerMSP432.h>

void PWMTimerMSP432_close(PWM_Handle handle);
int_fast16_t PWMTimerMSP432_control(PWM_Handle handle, uint_fast16_t cmd, void *arg);
void PWMTimerMSP432_init(PWM_Handle handle);
PWM_Handle PWMTimerMSP432_open(PWM_Handle handle, PWM_Params *params);
int_fast16_t PWMTimerMSP432_setDuty(PWM_Handle handle, uint32_t dutyValue);
int_fast16_t PWMTimerMSP432_setPeriod(PWM_Handle handle, uint32_t periodValue);
void PWMTimerMSP432_start(PWM_Handle handle);
void PWMTimerMSP432_stop(PWM_Handle handle);

/* PWM function table for PWMTimerMSP432 implementation */
const PWM_FxnTable myPWMTimerMSP432_fxnTable = {
    PWMTimerMSP432_close,
    NULL, /* PWMTimerMSP432_control, */
    PWMTimerMSP432_init,
    PWMTimerMSP432_open,
    PWMTimerMSP432_setDuty,
    NULL, /* PWMTimerMSP432_setPeriod, */
    PWMTimerMSP432_start,
    NULL /* PWMTimerMSP432_stop */
};

PWMTimerMSP432_Object pwmTimerMSP432Objects[Board_PWMCOUNT];

/* PWM configuration structure */
PWMTimerMSP432_HWAttrsV2 pwmTimerMSP432HWAttrs[Board_PWMCOUNT] = {
    /* pin mappable PWM channels */
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_0_TA0CCR1A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_1_TA0CCR2A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_2_TA0CCR3A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_3_TA0CCR4A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_4_TA1CCR1A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_5_TA1CCR2A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_6_TA1CCR3A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_7_TA1CCR4A
    },

	/* fixed pin mapped PWM channels */
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_1_TA0CCR1A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_2_TA0CCR2A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_3_TA0CCR3A
    },
    {
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .pwmPin = PWMTimerMSP432_P2_4_TA0CCR4A
    },
};

const PWM_Config PWM_config[] = {
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[0],
        .hwAttrs = &pwmTimerMSP432HWAttrs[0]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[1],
        .hwAttrs = &pwmTimerMSP432HWAttrs[1]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[2],
        .hwAttrs = &pwmTimerMSP432HWAttrs[2]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[3],
        .hwAttrs = &pwmTimerMSP432HWAttrs[3]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[4],
        .hwAttrs = &pwmTimerMSP432HWAttrs[4]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[5],
        .hwAttrs = &pwmTimerMSP432HWAttrs[5]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[6],
        .hwAttrs = &pwmTimerMSP432HWAttrs[6]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[7],
        .hwAttrs = &pwmTimerMSP432HWAttrs[7]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[8],
        .hwAttrs = &pwmTimerMSP432HWAttrs[8]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[9],
        .hwAttrs = &pwmTimerMSP432HWAttrs[9]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[10],
        .hwAttrs = &pwmTimerMSP432HWAttrs[10]
    },
    {
        .fxnTablePtr = &myPWMTimerMSP432_fxnTable,
        .object = &pwmTimerMSP432Objects[11],
        .hwAttrs = &pwmTimerMSP432HWAttrs[11]
    },
};

const uint_least8_t PWM_count = Board_PWMCOUNT;

