zekeng/msp432r-core/variants/MSP_EXP432P401R_BHS_Rev1/Board_init.c
/*
 *  ======== Board_initPWM ========
 */
void Board_initPWM(void)
{
    PWM_init();
}

/*
 *  =============================== SDSPI ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */
#if defined(__TI_COMPILER_VERSION__)
#pragma DATA_SECTION(SDSPI_config, ".const:SDSPI_config")
#pragma DATA_SECTION(sdspiMSP432HWAttrs, ".const:sdspiMSP432HWAttrs")
#endif

#include <ti/drivers/SDSPI.h>
#include <ti/drivers/sdspi/SDSPIMSP432.h>

/* SDSPI objects */
SDSPIMSP432_Object sdspiMSP432Objects[Board_SDSPICOUNT];

/* SDSPI configuration structure, describing which pins are to be used */
const SDSPIMSP432_HWAttrsV1 sdspiMSP432HWAttrs[Board_SDSPICOUNT] = {
    {
        .baseAddr = EUSCI_B0_BASE,
        .clockSource = EUSCI_B_SPI_CLOCKSOURCE_SMCLK,

        /* CLK, MOSI & MISO ports & pins */
        .sckPin = SDSPIMSP432_P1_5_UCB0CLK,
        .somiPin = SDSPIMSP432_P1_7_UCB0SOMI,
        .simoPin = SDSPIMSP432_P1_6_UCB0SIMO,

        /* Chip select port & pin */
        .csPin = SDSPIMSP432_P4_6_CS
    }
};

const SDSPI_Config SDSPI_config[] = {
    {
        .fxnTablePtr = &SDSPIMSP432_fxnTable,
        .object = &sdspiMSP432Objects[0],
        .hwAttrs = &sdspiMSP432HWAttrs[0]
    },
};

const uint_least8_t SDSPI_count = Board_SDSPICOUNT;

/*
 *  ======== Board_initSDSPI ========
 */
void Board_initSDSPI(void)
{
    SDSPI_init();
}

/*
 *  =============================== SPI ===============================
 */

#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPIMSP432DMA.h>

/* SPIMSP432DMA functions */
extern void SPIMSP432DMA_close(SPI_Handle handle);
extern int_fast16_t SPIMSP432DMA_control(SPI_Handle handle, uint_fast16_t cmd, void *arg);
extern void SPIMSP432DMA_init(SPI_Handle handle);
extern SPI_Handle SPIMSP432DMA_open(SPI_Handle handle, SPI_Params *params);
extern bool SPIMSP432DMA_transfer(SPI_Handle handle, SPI_Transaction *transaction);
extern void SPIMSP432DMA_transferCancel(SPI_Handle handle);

/* SPI function table for SPIMSP432DMA implementation */
const SPI_FxnTable mySPIMSP432DMA_fxnTable = {
    SPIMSP432DMA_close,
    NULL, /* SPIMSP432DMA_control, */
    SPIMSP432DMA_init,
    SPIMSP432DMA_open,
    SPIMSP432DMA_transfer,
    NULL /* SPIMSP432DMA_transferCancel */
};

/* SPI objects */
SPIMSP432DMA_Object spiMSP432DMAObjects[Board_SPICOUNT];

/* SPI configuration structure, describing which pins are to be used */
const SPIMSP432DMA_HWAttrsV1 spiMSP432DMAHWAttrs[Board_SPICOUNT] = {
    {
        .baseAddr = EUSCI_B0_BASE,
        .bitOrder = EUSCI_B_SPI_MSB_FIRST,
        .clockSource = EUSCI_B_SPI_CLOCKSOURCE_SMCLK,
        .defaultTxBufValue = 0,
        .dmaIntNum = INT_DMA_INT1,
        .intPriority = 0xC0,       /* make SPI interrupt one priority higher than default */
        .rxDMAChannelIndex = DMA_CH1_EUSCIB0RX0,
        .txDMAChannelIndex = DMA_CH0_EUSCIB0TX0,
        .clkPin  = SPIMSP432DMA_P1_5_UCB0CLK,
        .simoPin = SPIMSP432DMA_P1_6_UCB0SIMO,
        .somiPin = SPIMSP432DMA_P1_7_UCB0SOMI,
        .stePin  = SPIMSP432DMA_P1_4_UCB0STE,
        .pinMode  = EUSCI_SPI_3PIN,
        .minDmaTransferSize = 16
    }
};

const SPI_Config SPI_config[] = {
    {
        .fxnTablePtr = &mySPIMSP432DMA_fxnTable,
        .object = &spiMSP432DMAObjects[0],
        .hwAttrs = &spiMSP432DMAHWAttrs[0]
    }
};

const uint_least8_t SPI_count = Board_SPICOUNT;

/*
 *  =============================== Timer ===============================
 */
#include <ti/drivers/Timer.h>
#include <ti/drivers/timer/TimerMSP432.h>

TimerMSP432_Object timerMSP432Objects[Board_TIMERCOUNT];

const TimerMSP432_HWAttrs timerMSP432HWAttrs[Board_TIMERCOUNT] = {
    /* Timer32_0 */
    {
        .timerBaseAddress = TIMER32_0_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .intNum = INT_T32_INT1,
        .intPriority = ~0
    },
    {
        .timerBaseAddress = TIMER32_1_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_SMCLK,
        .intNum = INT_T32_INT2,
        .intPriority = ~0
    },
    /* Timer_A1 */
    {
        .timerBaseAddress = TIMER_A1_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_ACLK,
        .intNum = INT_TA1_0,
        .intPriority = ~0
    },
    /* Timer_A2 */
    {
        .timerBaseAddress = TIMER_A2_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_ACLK,
        .intNum = INT_TA2_0,
        .intPriority = ~0
    },
    /* Timer_A3 */
    {
        .timerBaseAddress = TIMER_A3_BASE,
        .clockSource = TIMER_A_CLOCKSOURCE_ACLK,
        .intNum = INT_TA3_0,
        .intPriority = ~0
    }
};

const Timer_Config Timer_config[Board_TIMERCOUNT] = {
    {
        .fxnTablePtr = &TimerMSP432_Timer32_fxnTable,
        .object = &timerMSP432Objects[Board_TIMER_T32_0],
        .hwAttrs = &timerMSP432HWAttrs[Board_TIMER_T32_0]
    },
    {
        .fxnTablePtr = &TimerMSP432_Timer32_fxnTable,
        .object = &timerMSP432Objects[Board_TIMER_T32_1],
        .hwAttrs = &timerMSP432HWAttrs[Board_TIMER_T32_1]
    },
    {
        .fxnTablePtr = &TimerMSP432_Timer_A_fxnTable,
        .object = &timerMSP432Objects[Board_TIMER_TA_1],
        .hwAttrs = &timerMSP432HWAttrs[Board_TIMER_TA_1]
    },
    {
        .fxnTablePtr = &TimerMSP432_Timer_A_fxnTable,
        .object = &timerMSP432Objects[Board_TIMER_TA_2],
        .hwAttrs = &timerMSP432HWAttrs[Board_TIMER_TA_2]
    },
    {
        .fxnTablePtr = &TimerMSP432_Timer_A_fxnTable,
        .object = &timerMSP432Objects[Board_TIMER_TA_3],
        .hwAttrs = &timerMSP432HWAttrs[Board_TIMER_TA_3]
    }
};

const uint_least8_t Timer_count = Board_TIMERCOUNT;

/*
 *  =============================== UART ===============================
 */

#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTMSP432.h>

extern void UARTMSP432_close(UART_Handle handle);
extern int_fast16_t UARTMSP432_control(UART_Handle handle, uint_fast16_t cmd,
        void *arg);
extern void UARTMSP432_init(UART_Handle handle);
extern UART_Handle UARTMSP432_open(UART_Handle handle, UART_Params *params);
extern int_fast32_t UARTMSP432_read(UART_Handle handle, void *buffer, size_t size);
extern void UARTMSP432_readCancel(UART_Handle handle);
extern int_fast32_t UARTMSP432_readPolling(UART_Handle handle, void *buffer,
        size_t size);
extern int_fast32_t UARTMSP432_write(UART_Handle handle, const void *buffer,
        size_t size);
extern void UARTMSP432_writeCancel(UART_Handle handle);
extern int_fast32_t UARTMSP432_writePolling(UART_Handle handle, const void *buffer,
        size_t size);

/* UART function table for UARTMP432 implementation */
const UART_FxnTable myUARTMSP432_fxnTable = {
    UARTMSP432_close,
    UARTMSP432_control,
    UARTMSP432_init,
    UARTMSP432_open,
    UARTMSP432_read,
    NULL, /* UARTMSP432_readPolling, */
    NULL, /* UARTMSP432_readCancel, */
    UARTMSP432_write,
    NULL, /* UARTMSP432_writePolling, */
    NULL /* UARTMSP432_writeCancel, */
};

/* UART objects */
UARTMSP432_Object uartMSP432Objects[Board_UARTCOUNT];

#ifndef ENERGIA_BOARD_SERIAL0_RING_BUFFER_SIZE
#define ENERGIA_BOARD_SERIAL0_RING_BUFFER_SIZE    128
#endif

#ifndef ENERGIA_BOARD_SERIAL1_RING_BUFFER_SIZE
#define ENERGIA_BOARD_SERIAL1_RING_BUFFER_SIZE    128
#endif

