zekeng/msp432r-core/variants/MSP_EXP432P401R_BHS_Rev1/Board_init.c
#ifndef ENERGIA_BOARD_SERIAL2_RING_BUFFER_SIZE
#define ENERGIA_BOARD_SERIAL2_RING_BUFFER_SIZE    128
#endif

#ifndef ENERGIA_BOARD_SERIAL3_RING_BUFFER_SIZE
#define ENERGIA_BOARD_SERIAL3_RING_BUFFER_SIZE    128
#endif

unsigned char uartMSP432RingBuffer0[ENERGIA_BOARD_SERIAL0_RING_BUFFER_SIZE];
unsigned char uartMSP432RingBuffer1[ENERGIA_BOARD_SERIAL1_RING_BUFFER_SIZE];

#ifdef ENERGIA_BOARD_SERIAL2_ENABLE
unsigned char uartMSP432RingBuffer2[ENERGIA_BOARD_SERIAL2_RING_BUFFER_SIZE];
#endif

#ifdef ENERGIA_BOARD_SERIAL3_ENABLE
unsigned char uartMSP432RingBuffer3[ENERGIA_BOARD_SERIAL3_RING_BUFFER_SIZE];
#endif

/*
 * The baudrate dividers were determined by using the MSP430 baudrate
 * calculator
 * http://software-dl.ti.com/msp430/msp430_public_sw/mcu/msp430/MSP430BaudRateConverter/index.html
 */
const UARTMSP432_BaudrateConfig uartMSP432Baudrates[] = {
    /* {baudrate, input clock, prescalar, UCBRFx, UCBRSx, oversampling} */
    {
        .outputBaudrate = 115200,
        .inputClockFreq = 24000000,
        .prescalar = 13,
        .hwRegUCBRFx = 0,
        .hwRegUCBRSx = 37,
        .oversampling = 1
    },
    {57600,  24000000,  26,  0, 111, 1},
    {38400,  24000000,  39,  1,   0, 1},
    {19200,  24000000,  78,  2,   0, 1},
    {9600,   24000000, 156,  4,   0, 1},
    {4800,   24000000, 312,  8,   0, 1},

    {115200, 12000000,   6,  8,  32, 1},
    {57600,  12000000,  13,  0,  37, 1},
    {38400,  12000000,  19,  8,  85, 1},
    {19200,  12000000,  39,  1,   0, 1},
    {9600,   12000000,  78,  2,   0, 1},
    {4800,   12000000, 156,  4,   0, 1},

    {115200, 6000000,    3,  4,   2, 1},
    {57600,  6000000,    6,  8,  32, 1},
    {38400,  6000000,    9, 12,  34, 1},
    {19200,  6000000,   19,  8,  85, 1},
    {9600,   6000000,   39,  1,   0, 1},
    {4800,   6000000,   78,  2,   0, 1},

    {115200, 3000000,    1, 10,   0, 1},
    {57600,  3000000,    3,  4,   2, 1},
    {38400,  3000000,    4, 14,   8, 1},
    {19200,  3000000,    9, 12,  34, 1},
    {9600,   3000000,   19,  8,  85, 1},
    {4800,   3000000,   39,  1,   0, 1},

    /* only 3 baud rates supported with */
    /* 32.678KHz input clock            */
    {19200,  32768,      1,  0, 183, 0},
    {9600,   32768,      3,  0, 146, 0},
    {4800,   32768,      6,  0, 238, 0},
};

/* UART configuration structure */
const UARTMSP432_HWAttrsV1 uartMSP432HWAttrs[Board_UARTCOUNT] = {
    {
        .baseAddr = EUSCI_A0_BASE,
        .intNum = INT_EUSCIA0,
        .intPriority = (0xc0),
        .clockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK,
        .bitOrder = EUSCI_A_UART_LSB_FIRST,
        .numBaudrateEntries = sizeof(uartMSP432Baudrates) /
                              sizeof(UARTMSP432_BaudrateConfig),
        .baudrateLUT = uartMSP432Baudrates,
        .ringBufPtr  = uartMSP432RingBuffer0,
        .ringBufSize = sizeof(uartMSP432RingBuffer0),
        .rxPin = UARTMSP432_P1_2_UCA0RXD,
        .txPin = UARTMSP432_P1_3_UCA0TXD
    },

    {
        .baseAddr = EUSCI_A1_BASE,
        .intNum = INT_EUSCIA1,
        .intPriority = (0xc0),
        .clockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK,
        .bitOrder = EUSCI_A_UART_LSB_FIRST,
        .numBaudrateEntries = sizeof(uartMSP432Baudrates) /
                              sizeof(UARTMSP432_BaudrateConfig),
        .baudrateLUT = uartMSP432Baudrates,
        .ringBufPtr  = uartMSP432RingBuffer1,
        .ringBufSize = sizeof(uartMSP432RingBuffer1),
        .rxPin = UARTMSP432_P2_2_UCA1RXD,
        .txPin = UARTMSP432_P2_3_UCA1TXD
    },

#ifdef ENERGIA_BOARD_SERIAL2_ENABLE
    {
        .baseAddr = EUSCI_A2_BASE,
        .intNum = INT_EUSCIA2,
        .intPriority = (0xc0),
        .clockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK,
        .bitOrder = EUSCI_A_UART_LSB_FIRST,
        .numBaudrateEntries = sizeof(uartMSP432Baudrates) /
            sizeof(UARTMSP432_BaudrateConfig),
        .baudrateLUT = uartMSP432Baudrates,
        .ringBufPtr  = uartMSP432RingBuffer2,
        .ringBufSize = sizeof(uartMSP432RingBuffer2),
        .rxPin = UARTMSP432_P3_2_UCA2RXD,
        .txPin = UARTMSP432_P3_3_UCA2TXD
    },
#endif

#ifdef ENERGIA_BOARD_SERIAL3_ENABLE
    {
        .baseAddr = EUSCI_A3_BASE,
        .intNum = INT_EUSCIA3,
        .intPriority = (0xc0),
        .clockSource = EUSCI_A_UART_CLOCKSOURCE_SMCLK,
        .bitOrder = EUSCI_A_UART_LSB_FIRST,
        .numBaudrateEntries = sizeof(uartMSP432Baudrates) /
                              sizeof(UARTMSP432_BaudrateConfig),
        .baudrateLUT = uartMSP432Baudrates,
        .ringBufPtr  = uartMSP432RingBuffer3,
        .ringBufSize = sizeof(uartMSP432RingBuffer3),
        .rxPin = UARTMSP432_P9_6_UCA3RXD,
        .txPin = UARTMSP432_P9_7_UCA3TXD
    },
#endif
};

const UART_Config UART_config[] = {
    {
        .fxnTablePtr = &myUARTMSP432_fxnTable,
        .object = &uartMSP432Objects[Board_UARTA0],
        .hwAttrs = &uartMSP432HWAttrs[Board_UARTA0]
    },

    {
        .fxnTablePtr = &myUARTMSP432_fxnTable,
        .object = &uartMSP432Objects[Board_UARTA2],
        .hwAttrs = &uartMSP432HWAttrs[Board_UARTA2]
    },

#ifdef ENERGIA_BOARD_SERIAL2_ENABLE
    {
        .fxnTablePtr = &myUARTMSP432_fxnTable,
        .object = &uartMSP432Objects[Board_UARTA1],
        .hwAttrs = &uartMSP432HWAttrs[Board_UARTA1]
    },
#endif

#ifdef ENERGIA_BOARD_SERIAL3_ENABLE
    {
        .fxnTablePtr = &myUARTMSP432_fxnTable,
        .object = &uartMSP432Objects[Board_UARTA3],
        .hwAttrs = &uartMSP432HWAttrs[Board_UARTA3]
    },
#endif
};

const uint_least8_t UART_count = Board_UARTCOUNT;

/*
 *  =============================== Watchdog ===============================
 */
/* Place into subsections to allow the TI linker to remove items properly */

#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogMSP432.h>

/* Watchdog objects */
WatchdogMSP432_Object watchdogMSP432Objects[Board_WATCHDOGCOUNT];

/* Watchdog configuration structure */
const WatchdogMSP432_HWAttrs watchdogMSP432HWAttrs[Board_WATCHDOGCOUNT] = {
    {
        .baseAddr = WDT_A_BASE,
        .intNum = INT_WDT_A,
        .intPriority = (~0),
        .clockSource = WDT_A_CLOCKSOURCE_SMCLK,
        .clockDivider = WDT_A_CLOCKDIVIDER_8192K
    },
};

const Watchdog_Config Watchdog_config[] = {
    {
        .fxnTablePtr = &WatchdogMSP432_fxnTable,
        .object = &watchdogMSP432Objects[0],
        .hwAttrs = &watchdogMSP432HWAttrs[0]
    },
};

const uint_least8_t Watchdog_count = Board_WATCHDOGCOUNT;

/*
 *  ======== Board_initWatchdog ========
 */
void Board_initWatchdog(void)
{
    /* Initialize the Watchdog driver */
    Watchdog_init();
}

/*
 *  ======== Board_init ========
 */
void Board_init(void) {
    Board_initGPIO();
    Board_initPWM();
    Board_initPower();
}

